//=============================================================================
// 
//  弾のマネージャ処理 [bulletmanager.cpp]
//  Author : 相馬靜雅
// 
//=============================================================================
#include "debugproc.h"
#include "bulletmanager.h"
#include "calculation.h"
#include "manager.h"
#include "game.h"
#include "renderer.h"

//==========================================================================
// コンストラクタ
//==========================================================================
CBulletManager::CBulletManager()
{
	// 値のクリア
	m_nNumAll = 0;	// 総数リセット
}

//==========================================================================
// デストラクタ
//==========================================================================
CBulletManager::~CBulletManager()
{

}

//==========================================================================
// 生成処理
//==========================================================================
CBulletManager *CBulletManager::Create(void)
{
	// 生成用のオブジェクト
	CBulletManager *pModel = NULL;

	if (pModel == NULL)
	{// NULLだったら

		// メモリの確保
		pModel = DEBUG_NEW CBulletManager;

		if (pModel != NULL)
		{// メモリの確保が出来ていたら

			// 初期化処理
			HRESULT hr = pModel->Init();
			if (FAILED(hr))
			{// 失敗していたら
				return NULL;
			}
		}

		return pModel;
	}

	return NULL;
}

//==========================================================================
// 初期化処理
//==========================================================================
HRESULT CBulletManager::Init(void)
{
	// 総数リセット
	m_nNumAll = 0;

	return S_OK;
}

//==========================================================================
// 割り当て
//==========================================================================
void CBulletManager::Regist(CBullet *pBullet)
{
	// リストに追加
	m_List.Regist(pBullet);

	// 総数加算
	m_nNumAll++;
}

//==========================================================================
// 削除
//==========================================================================
void CBulletManager::Delete(CBullet *pItem)
{
	// 自分自身をリストから探す
	m_List.Delete(pItem);

	// 総数減算
	m_nNumAll--;
}

//==========================================================================
// 終了処理
//==========================================================================
void CBulletManager::Uninit(void)
{
	// 総数
	m_nNumAll = 0;
}

//==========================================================================
// 全て削除
//==========================================================================
void CBulletManager::KillAll(void)
{
	// 全削除
	m_List.KillAll();

	// 総数
	m_nNumAll = 0;
}

//==========================================================================
// 弾の総数取得
//==========================================================================
int CBulletManager::GetNumAll(void)
{
	return m_nNumAll;
}

//==========================================================================
// アイテムのリスト取得
//==========================================================================
std::list<CBullet*> CBulletManager::GetList(void)
{
	return m_List.GetList();
}
